[
  {
    "id": 1,
    "title": "Scaling Data Infrastructure for E-commerce Giant",
    "client": "Major E-commerce Platform",
    "industry": "E-commerce",
    "challenge": "A fast-growing e-commerce company needed to scale their data infrastructure to handle 10x traffic growth. They required a team of senior data engineers with expertise in real-time processing and cloud platforms.",
    "solution": "DataVruti identified and placed 5 senior data engineers within 3 weeks, all with expertise in Apache Kafka, Spark, and AWS. We matched candidates based on both technical skills and startup culture fit.",
    "result": "The client successfully migrated to a scalable architecture, reduced data processing time by 60%, and built a foundation for handling future growth. All placements remained with the company beyond 18 months.",
    "timeframe": "3 weeks",
    "placements": 5,
    "image": "/images/case-studies/ecommerce.jpg"
  },
  {
    "id": 2,
    "title": "Building ML Team from Ground Up",
    "client": "FinTech Startup",
    "industry": "Financial Services",
    "challenge": "A FinTech startup needed to build their entire ML team to develop fraud detection and risk assessment models. They had no existing ML infrastructure or team.",
    "solution": "We provided strategic consulting on team structure and hired 3 data scientists and 2 ML engineers with expertise in financial modeling, fraud detection, and MLOps best practices.",
    "result": "The team built and deployed 3 production ML models within 6 months, reducing fraud by 45% and improving risk assessment accuracy by 30%.",
    "timeframe": "6 weeks",
    "placements": 5,
    "image": "/images/case-studies/fintech.jpg"
  },
  {
    "id": 3,
    "title": "Analytics Transformation for Healthcare Provider",
    "client": "Healthcare Services Company",
    "industry": "Healthcare",
    "challenge": "A healthcare provider wanted to transform their analytics capabilities to enable data-driven patient care decisions. They needed both technical talent and strategic guidance.",
    "solution": "DataVruti provided analytics consulting and placed 2 analytics consultants and 3 data analysts with healthcare domain expertise. We helped design their analytics roadmap and tool stack.",
    "result": "Implemented end-to-end analytics platform, trained 50+ staff members, and achieved 25% improvement in patient outcomes through data-driven insights.",
    "timeframe": "8 weeks",
    "placements": 5,
    "image": "/images/case-studies/healthcare.jpg"
  }
]
