[
  {
    "id": 1,
    "slug": "asper-ai-ml-saas-scm",
    "title": "Building Core Tech Team for AI/ML SaaS Startup",
    "client": "Asper.ai",
    "industry": "AI/ML SaaS - Supply Chain Management",
    "challenge": "Asper.ai was operating under the shadow of its large parent company (Fractal), and was looking for talent partners who can help them pitch the opportunity to relevant candidates while still keeping an extremely high bar for the quality of candidates presented. Key challenges included: no brand awareness, poor articulation of problem statement, spending too much time on interviews, and struggling to build core tech team.",
    "solution": "Our team conducted several interviews to understand the company history, product, its roadmap, and built an extremely strong candidate pitch. We did thorough sourcing & screening, including 30-45 minute calls for senior roles to ensure only the best candidates were presented to the client. Our ownership, research, conviction and communication style ensured that candidates felt they were talking to Asper.ai directly, not a third party.",
    "result": "Successfully closed all key positions within 4 months, including Head of Engineering, Head of Design, Lead Data Scientist, and multiple Junior Data Scientists (both permanent and contract). Our pitch and conviction made candidates forget they were talking to external recruiters and assumed we were part of Asper.ai.",
    "timeframe": "4 months",
    "placements": 6,
    "testimonial": {
      "name": "Guha Athreya",
      "role": "Chief Product Officer",
      "company": "Current customer at Ai Palette and previously at Asper.ai",
      "quote": "I have had the pleasure of working with Vikram and his recruitment agency on multiple occasions, and each time, they have exceeded my expectations. Their unique approach to understanding the specific needs of the job beyond the written description has resulted in a consistently high success rate in finding the right talent, especially for niche roles. His thorough vetting process makes him an invaluable partner. I highly recommend Vikram and his team to anyone looking for top-tier recruitment services."
    },
    "image": "/images/case-studies/asper-ai.jpg"
  }
]
