[
  {
    "id": 1,
    "slug": "scaling-data-infrastructure-ecommerce",
    "title": "Scaling Data Infrastructure for E-commerce Giant",
    "client": "Major E-commerce Platform",
    "industry": "E-commerce",
    "challenge": "A fast-growing e-commerce company needed to scale their data infrastructure to handle 10x traffic growth. They required a team of senior data engineers with expertise in real-time processing and cloud platforms.",
    "solution": "DataVruti identified and placed 5 senior data engineers within 3 weeks, all with expertise in Apache Kafka, Spark, and AWS. We matched candidates based on both technical skills and startup culture fit.",
    "result": "The client successfully migrated to a scalable architecture, reduced data processing time by 60%, and built a foundation for handling future growth. All placements remained with the company beyond 18 months.",
    "timeframe": "3 weeks",
    "placements": 5,
    "image": "/images/case-studies/ecommerce.jpg"
  },
  {
    "id": 2,
    "slug": "building-ml-team-fintech",
    "title": "Building ML Team from Ground Up",
    "client": "FinTech Startup",
    "industry": "Financial Services",
    "challenge": "A FinTech startup needed to build their entire ML team to develop fraud detection and risk assessment models. They had no existing ML infrastructure or team.",
    "solution": "We provided strategic consulting on team structure and hired 3 data scientists and 2 ML engineers with expertise in financial modeling, fraud detection, and MLOps best practices.",
    "result": "The team built and deployed 3 production ML models within 6 months, reducing fraud by 45% and improving risk assessment accuracy by 30%.",
    "timeframe": "6 weeks",
    "placements": 5,
    "image": "/images/case-studies/fintech.jpg"
  },
  {
    "id": 3,
    "slug": "analytics-transformation-healthcare",
    "title": "Analytics Transformation for Healthcare Provider",
    "client": "Healthcare Services Company",
    "industry": "Healthcare",
    "challenge": "A healthcare provider wanted to transform their analytics capabilities to enable data-driven patient care decisions. They needed both technical talent and strategic guidance.",
    "solution": "DataVruti provided analytics consulting and placed 2 analytics consultants and 3 data analysts with healthcare domain expertise. We helped design their analytics roadmap and tool stack.",
    "result": "Implemented end-to-end analytics platform, trained 50+ staff members, and achieved 25% improvement in patient outcomes through data-driven insights.",
    "timeframe": "8 weeks",
    "placements": 5,
    "image": "/images/case-studies/healthcare.jpg"
  },
  {
    "id": 4,
    "slug": "data-warehouse-modernization-retail",
    "title": "Data Warehouse Modernization for Retail Chain",
    "client": "National Retail Corporation",
    "industry": "Retail",
    "challenge": "A major retail chain was struggling with legacy data systems that couldn't support real-time inventory and customer analytics. They needed to modernize their entire data warehouse infrastructure.",
    "solution": "DataVruti placed 4 data architects and 3 data engineers specializing in Snowflake, dbt, and modern data stack tools. We helped design the migration strategy and built the new data team.",
    "result": "Successfully migrated to a cloud data warehouse, enabling real-time inventory tracking across 500+ stores. Reduced reporting time from days to minutes, and increased sales by 18% through better inventory management.",
    "timeframe": "5 weeks",
    "placements": 7,
    "image": "/images/case-studies/retail.jpg"
  },
  {
    "id": 5,
    "slug": "ai-powered-customer-insights-saas",
    "title": "AI-Powered Customer Insights Platform",
    "client": "B2B SaaS Company",
    "industry": "Technology",
    "challenge": "A rapidly growing SaaS company wanted to build an AI-powered customer insights platform to reduce churn and increase upsells. They needed specialized AI/ML talent quickly.",
    "solution": "We recruited 2 senior ML engineers, 2 data scientists, and 1 MLOps engineer with expertise in NLP, recommendation systems, and production ML infrastructure.",
    "result": "Launched a predictive analytics platform that identified at-risk customers with 85% accuracy. Reduced churn by 32% and increased upsell conversion by 27% within the first year.",
    "timeframe": "4 weeks",
    "placements": 5,
    "image": "/images/case-studies/saas.jpg"
  },
  {
    "id": 6,
    "slug": "real-time-analytics-logistics",
    "title": "Real-Time Analytics for Logistics Platform",
    "client": "Logistics Technology Startup",
    "industry": "Logistics",
    "challenge": "A logistics startup needed to build real-time analytics capabilities to optimize delivery routes and predict delays. They required engineers with expertise in streaming data and geospatial analysis.",
    "solution": "DataVruti sourced 3 senior data engineers with expertise in Apache Flink, Kafka Streams, and geospatial databases, plus 2 data scientists specializing in route optimization.",
    "result": "Implemented real-time tracking and predictive analytics system that reduced delivery times by 23% and fuel costs by 15%. The platform now processes 2M events per second.",
    "timeframe": "6 weeks",
    "placements": 5,
    "image": "/images/case-studies/logistics.jpg"
  },
  {
    "id": 7,
    "slug": "data-governance-financial-institution",
    "title": "Enterprise Data Governance Implementation",
    "client": "Global Financial Institution",
    "industry": "Banking",
    "challenge": "A multinational bank needed to implement comprehensive data governance and compliance frameworks to meet regulatory requirements across multiple jurisdictions.",
    "solution": "We placed 2 data governance specialists, 3 data stewards, and 2 compliance-focused data engineers with deep expertise in financial regulations, GDPR, and data quality management.",
    "result": "Established enterprise-wide data governance framework, achieved 100% regulatory compliance, and improved data quality scores by 40%. Successfully passed all audits in the first year.",
    "timeframe": "10 weeks",
    "placements": 7,
    "image": "/images/case-studies/banking.jpg"
  },
  {
    "id": 8,
    "slug": "customer-360-media-company",
    "title": "Building Customer 360 Platform for Media Giant",
    "client": "Digital Media Company",
    "industry": "Media & Entertainment",
    "challenge": "A media company with multiple properties needed to unify customer data across platforms to create personalized content recommendations and targeted advertising.",
    "solution": "DataVruti recruited 3 data engineers specializing in data integration, 2 analytics engineers, and 2 data scientists with expertise in recommendation systems and user modeling.",
    "result": "Built a unified customer data platform integrating 8 data sources. Increased content engagement by 35% and ad revenue by 28% through personalized recommendations.",
    "timeframe": "7 weeks",
    "placements": 7,
    "image": "/images/case-studies/media.jpg"
  }
]
