[
  {
    "id": "Consult-Deliver",
    "title": "Consult & Deliver",
    "slug": "Consult-Deliver",
    "shortDescription": "Bring in HR industry veterans who walk the talk.",
    "description": "Our consulting services bring decades of HR and recruitment expertise to help you navigate complex talent challenges. We don't just advise—we deliver results through actionable strategies and hands-on support.",
    "benefits": [
      "50+ years combined experience from senior leaders",
      "Deep understanding of BFSI, SaaS, IT/ITES, and Consulting industries",
      "Strategic talent acquisition planning and implementation",
      "End-to-end recruitment process optimization",
      "Custom solutions tailored to your organizational needs"
    ],
    "icon": "lightbulb"
  },
  {
    "id": "Search-Select",
    "title": "Search & Select",
    "slug": "Search-Select",
    "shortDescription": "From CXOs to junior staff, attract top talent who can join soon.",
    "description": "Our Search & Select service is designed to find and attract the best talent across all levels—from C-suite executives to junior professionals. We ensure candidates are ready to join quickly without compromising on quality.",
    "benefits": [
      "Leadership hiring: CXOs, VPs, Heads of Departments",
      "Lateral hiring: Mid-level to senior professionals",
      "Volume hiring: Junior to mid-level positions at scale",
      "Fast turnaround: Candidates ready to join within 2 weeks",
      "Rigorous screening: Only the most relevant candidates presented"
    ],
    "icon": "chart"
  },
  {
    "id": "Staffing & Payroll",
    "title": "Staffing & Payroll",
    "slug": "Staffing-Payroll",
    "shortDescription": "Get ready to deploy resources on short notice.",
    "description": "Our Staffing & Payroll services provide flexible workforce solutions for short-term projects, seasonal demands, or ongoing needs. We handle all compliance, payroll, and administrative tasks so you can focus on your business.",
    "benefits": [
      "Contract staffing for short-term and project-based needs",
      "Payroll management and compliance handling",
      "Quick deployment: Resources ready on short notice",
      "Flexible engagement models to suit your requirements",
      "End-to-end workforce management support"
    ],
    "icon": "database"
  }
]
